---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.Currency
source: html/df97d7d6-720c-34f6-f2c8-aa2d29c61083.htm
---
# Autodesk.Revit.DB.SpecTypeId.Currency Property

Currency, in discipline Common.

## Syntax (C#)
```csharp
public static ForgeTypeId Currency { get; }
```